{
  "slug": "oar",
  "name": "O.A.R.",
  "biography": "O.A.R. (Of A Revolution) is an American rock band founded in 1996 in Rockville, Maryland. The band first came together in the basement of drummer Chris Culos' childhood home, with four of the five members having grown up in Rockville and attended Thomas S. Wootton High School together. They played their first gig at an eighth-grade talent show before officially forming in 1996. The name \"Revolution\" references what the music was doing for them back in high school - a positive change in their daily lives.\n\nAfter high school, the founding members attended Ohio State University, where they met saxophonist Jerry DePizzo from Youngstown, Ohio, who joined the band in 2000. Known for their rigorous touring schedule and exhilarating live shows, O.A.R. has built one of the most passionate and devoted fan communities in music. They have released ten studio albums and six live albums, with their most recent being Live From Boston in December 2024.\n\nOver three decades, O.A.R. has sold almost 2 million albums and over 2 million concert tickets. They have sold out Madison Square Garden twice, headlined Red Rocks Amphitheatre more than a dozen times, earned multiple Platinum and Gold certifications, and achieved over 1 billion streams. The band earned RIAA Gold certifications, three Top 15 Billboard 200 debuts, and has collaborated with artists ranging from Robert Redford and Goo Goo Dolls to Wiz Khalifa and DJ Premier. They even lit up the Times Square New Year's Eve celebration.\n\nThe band has pursued charitable initiatives through their Heard The World Fund, founded in 2006. In recognition of their connection to their hometown, Howard County, Maryland declared July 19 as O.A.R. Day in 2014 after the band returned to Merriweather Post Pavilion in Columbia, Maryland for the 10th consecutive summer. In 2025, O.A.R. contributed an original song, \"Our Diamond, Our District,\" to the Washington Nationals' City Connect uniform launch.",
  "members": {
    "current": [
      {
        "name": "Marc Roberge",
        "role": "Lead Vocals, Rhythm Guitar",
        "years": "1996-present"
      },
      {
        "name": "Chris Culos",
        "role": "Drums",
        "years": "1996-present"
      },
      {
        "name": "Richard On",
        "role": "Lead Guitar, Backing Vocals",
        "years": "1996-present"
      },
      {
        "name": "Benj Gershman",
        "role": "Bass (part-time since 2020)",
        "years": "1996-present"
      },
      {
        "name": "Jerry DePizzo",
        "role": "Saxophone, Guitar",
        "years": "2000-present"
      }
    ],
    "former": [],
    "touring": [
      {
        "name": "Mikel Paris",
        "role": "Keyboards, Percussion, Backing Vocals",
        "years": "2006-present"
      },
      {
        "name": "Jon Lampley",
        "role": "Trumpet, Vocals",
        "years": "2011-present"
      },
      {
        "name": "Evan Oberla",
        "role": "Trombone, Backing Vocals",
        "years": "2011-present"
      }
    ]
  },
  "careerHighlights": [
    "1996: Band officially formed at Thomas S. Wootton High School in Rockville, Maryland",
    "1996: Recorded debut album 'The Wanderer' at Gizmo Recording Company in Silver Spring, Maryland",
    "1999: Released 'Soul's Aflame'",
    "2001: Released 'Risen', first collaboration with producer John Alagia",
    "2003: Major-label breakthrough with 'In Between Now and Then'",
    "2005: Released 'Stories of a Stranger', first album to receive mainstream success",
    "2006: Founded Heard The World Fund charitable organization",
    "2006: Sold out Madison Square Garden (January 14), drawing roughly 18,000 fans",
    "2007: Second sold-out Madison Square Garden show (January 27), featured in New York Times",
    "2008: Released 'All Sides' and 'Live at Madison Square Garden' concert film",
    "2011: Released 'King' which debuted at #12 on Billboard 200 (highest-charting debut)",
    "2014: Released 'The Rockville LP', debuted at #13 on Billboard 200 and #1 Independent Albums",
    "2014: Howard County, Maryland declared July 19 as O.A.R. Day",
    "2019: Released 'The Mighty'",
    "2022: Released 'The Arcade' (tenth studio album)",
    "2024: Released 'Live From Boston' (December)",
    "2025: Contributed 'Our Diamond, Our District' to Washington Nationals' City Connect launch"
  ],
  "recordingStats": {
    "studioAlbums": 10,
    "liveAlbums": 6,
    "albumsSold": "~2 million",
    "concertTicketsSold": "2+ million",
    "totalStreams": "1+ billion",
    "yearsActive": "1996-present",
    "madisonSquareGardenSellouts": 2,
    "redRocksHeadlines": "12+"
  },
  "socialLinks": {
    "website": "https://www.liveoar.com",
    "youtube": "https://www.youtube.com/ofarevolution",
    "facebook": "https://www.facebook.com/ofarevolution",
    "instagram": "https://www.instagram.com/ofarevolution",
    "twitter": "https://x.com/ofarevolution",
    "tiktok": "https://www.tiktok.com/@ofarevolution",
    "spotify": "https://open.spotify.com/artist/66ihevNkSYNzRAl44dx6jJ"
  },
  "images": []
}
